In [1]:
from sqlalchemy import create_engine
import pandas as pd
import re 

def connect_db(dico):

    str_engine = "mysql+" + dico["connector"] + "://" + dico["user"] + ":" + dico["pwd"] + "@" + dico["host"] + ":" + dico["port"] + "/" + dico["bdd"]
    connect = create_engine(str_engine)
    return connect

d = {
    "connector": "pymysql",
    "user" : "xaviermysql",
    "pwd" : "simplon",
    "host" : "127.0.0.1",
    "port": "3306",
    "bdd" : "survey"
}

engine = connect_db(d)
# https://docs.sqlalchemy.org/en/14/core/engines.html

In [2]:
survey_data = pd.read_excel("/home/simplon/PYTHON CODE/PythontoSQL/Data_Professional_Salary_Survey_Responses_1.xlsx")
survey_data.columns
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html

Index(['Survey Year', 'Timestamp', 'SalaryUSD', 'Country', 'PostalCode',
       'PrimaryDatabase', 'YearsWithThisDatabase', 'OtherDatabases',
       'EmploymentStatus', 'JobTitle', 'ManageStaff', 'YearsWithThisTypeOfJob',
       'HowManyCompanies', 'OtherPeopleOnYourTeam', 'CompanyEmployeesOverall',
       'DatabaseServers', 'Education', 'EducationIsComputerRelated',
       'Certifications', 'HoursWorkedPerWeek', 'TelecommuteDaysPerWeek',
       'NewestVersionInProduction', 'OldestVersionInProduction',
       'PopulationOfLargestCityWithin20Miles', 'EmploymentSector',
       'LookingForAnotherJob', 'CareerPlansThisYear', 'Gender',
       'OtherJobDuties', 'KindsOfTasksPerformed', 'Counter'],
      dtype='object')

# Création DataFrames pour insertion dans la base de données

sondage_item_df

In [3]:
sondage_item_dic = {
    "timestamp": "Timestamp",
    "salary_usd" : "SalaryUSD",
    "postal_code" : "PostalCode",
    "years_with_db" : "YearsWithThisDatabase",
    "manage_staff": "ManageStaff",
    "years_with_job" : "YearsWithThisTypeOfJob",
    "other_people": "OtherPeopleOnYourTeam",
    "company_employee" : "CompanyEmployeesOverall",
    "database_servers" : "DatabaseServers",
    "education_computer" : "EducationIsComputerRelated",
    "hours_worked": "HoursWorkedPerWeek",
    "telecommute" : "TelecommuteDaysPerWeek",
    "newest_version": "NewestVersionInProduction",
    "oldest_version" : "OldestVersionInProduction",
    "gender" : "Gender"

}

sondage_item_df = pd.DataFrame(columns = [i for i in sondage_item_dic.keys()])

# Settage des index

sondage_item_df = sondage_item_df.rename_axis(index="sgi_id")

for i in sondage_item_dic.keys():
   sondage_item_df[str(i)] = survey_data[str(sondage_item_dic[i])]

In [4]:
sondage_item_df

,timestamp,salary_usd,postal_code,years_with_db,manage_staff,years_with_job,other_people,company_employee,database_servers,education_computer,hours_worked,telecommute,newest_version,oldest_version,gender
sgi_id,,,,,,,,,,,,,,,
0,2020-12-10 08:22:42.696,65000.0,NaN,4,Yes,4,None,2,Not Asked,Not Asked,Not Asked,Not Asked,SQL Server 2016,SQL Server 2016,Male
1,2020-12-10 08:23:22.242,145000.0,76063,15,No,25,None,74,Not Asked,Not Asked,Not Asked,Not Asked,SQL Server 2019,SQL Server 2014,Male
2,2020-12-10 08:23:37.909,105000.0,43240,12,Yes,6,1,500,Not Asked,Not Asked,Not Asked,Not Asked,SQL Server 2017,SQL Server 2008R2,Male
3,2020-12-10 08:23:48.152,46482.0,NaN,10,No,5,None,35,Not Asked,Not Asked,Not Asked,Not Asked,SQL Server 2019,SQL Server 2012,Male
4,2020-12-10 08:24:03.600,98800.0,468,5,No,5,None,50,Not Asked,Not Asked,Not Asked,Not Asked,SQL Server 2019,SQL Server 2012,Male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10336,2017-01-14 15:50:23.936,36549.0,Not Asked,3,No,1,1,Not Asked,42,NaN,38,"None, or less than 1 day per week",Not Asked,Not Asked,Not Asked
10337,2017-01-15 01:01:21.212,65000.0,Not Asked,7,Yes,3,5,Not Asked,40,Yes,50,1,Not Asked,Not Asked,Not Asked
10338,2017-01-15 03:25:47.422,85000.0,Not Asked,17,No,17,1,Not Asked,200,No,40,1,Not Asked,Not Asked,Not Asked
10339,2017-01-15 03:37:35.305,90000.0,Not Asked,8,No,3,1,Not Asked,80,Yes,45,5 or more,Not Asked,Not Asked,Not Asked
10340,2017-01-15 03:37:59.149,23000.0,Not Asked,4,No,9,3,Not Asked,10,Yes,40,"None, or less than 1 day per week",Not Asked,Not Asked,Not Asked

## DataFrame carreer_plan

In [5]:
carrer_plan_columns = pd.read_sql_query("select * from carreer_plan;", engine).columns
carrer_plan_columns

Index(['cap_id', 'cap_plan'], dtype='object')

In [6]:
carreer_plan_df = pd.DataFrame(columns = carrer_plan_columns)
carreer_plan_df['cap_plan'] = survey_data['CareerPlansThisYear']
carreer_plan_df.drop_duplicates(inplace=True)

In [7]:
carreer_plan_df = carreer_plan_df.reset_index(drop=True)
#carreer_plan_df = carreer_plan_df.drop(columns='cap_id')
#carreer_plan_df=carreer_plan_df.rename_axis(index='cap_id')
carreer_plan_df.index +=1
carreer_plan_df['cap_id'] = carreer_plan_df.index
carreer_plan_df

   cap_id                                        cap_plan
1       1          Stay with the same employer, same role
2       2                               Prefer not to say
3       3                 Change both employers and roles
4       4   Stay with the same role, but change employers
5       5  Stay with the same employer,  but change roles
6       6                                       Not Asked

In [8]:
id_cap = survey_data['CareerPlansThisYear'].apply(lambda x: carreer_plan_df[carreer_plan_df['cap_plan']==x].index[0])
sondage_item_df['cap_id'] = id_cap.astype(pd.Int64Dtype())

In [9]:
sondage_item_df['cap_id'].iloc[0]

1

In [10]:
id_cap

0        1
1        1
2        1
3        1
4        1
        ..
10336    6
10337    6
10338    6
10339    6
10340    6
Name: CareerPlansThisYear, Length: 10341, dtype: int64

## DataFrame certification

In [11]:
certification_columns = pd.read_sql_query("select * from certification;", engine).columns
certification_columns

Index(['cert_id', 'cert_name'], dtype='object')

In [12]:
certification_df = pd.DataFrame(columns = certification_columns)
certification_df['cert_name'] = survey_data['Certifications']
certification_df.drop_duplicates(inplace=True)

In [13]:
certification_df

     cert_id                         cert_name
0        NaN                         Not Asked
3470     NaN                  No, I never have
3472     NaN  Yes, and they're currently valid
3475     NaN             Yes, but they expired

In [14]:
#certification_df = certification_df.drop(columns='cert_id')
certification_df = certification_df.reset_index(drop=True)
certification_df.index+=1

In [15]:
#certification_df = certification_df.rename_axis(index='cert_id')
certification_df['cert_id']=certification_df.index
certification_df

   cert_id                         cert_name
1        1                         Not Asked
2        2                  No, I never have
3        3  Yes, and they're currently valid
4        4             Yes, but they expired

In [16]:
id_cert = survey_data['Certifications'].apply(lambda x: certification_df[certification_df['cert_name']==x].index[0])
sondage_item_df['cert_id'] = id_cert.astype(pd.Int64Dtype())

In [17]:
sondage_item_df['cert_id']

sgi_id
0        1
1        1
2        1
3        1
4        1
        ..
10336    2
10337    2
10338    2
10339    3
10340    3
Name: cert_id, Length: 10341, dtype: Int64

## DataFrame country

In [18]:
country_columns = pd.read_sql_query("select * from country;", engine).columns
country_columns

Index(['ctr_id', 'ctr_name'], dtype='object')

In [19]:
country_df = pd.DataFrame(columns = country_columns)
country_df['ctr_name'] = survey_data['Country']
country_df.drop_duplicates(inplace=True)

In [20]:
country_df = country_df.reset_index()
country_df.index += 1

In [21]:
#country_df.rename_axis(index='ctr_id',inplace=True)

In [22]:
country_df = country_df.drop(columns='index')
country_df['ctr_id'] = country_df.index
country_df

    ctr_id        ctr_name
1        1          Sweden
2        2   United States
3        3  United Kingdom
4        4        Pakistan
5        5        Paraguay
..     ...             ...
93      93         Albania
94      94         Bolivia
95      95         Vietnam
96      96         Bermuda
97      97           Kenya

[97 rows x 2 columns]

In [23]:
id_ctr = survey_data["Country"].apply(lambda x: country_df[country_df["ctr_name"] == x].index[0])
sondage_item_df['ctr_id'] = id_ctr.astype(pd.Int64Dtype())

In [24]:
sondage_item_df['ctr_id']

sgi_id
0         1
1         2
2         2
3         3
4         2
         ..
10336     3
10337    73
10338    28
10339     2
10340    18
Name: ctr_id, Length: 10341, dtype: Int64

In [25]:
#country_df.to_sql("country",if_exists="append", con=engine, index=False)

## DataFrame education

In [26]:
education_columns = pd.read_sql_query("select * from education;", engine).columns
education_columns

Index(['edu_id', 'edu_title'], dtype='object')

In [27]:
education_df = pd.DataFrame(columns = education_columns)
education_df['edu_title'] = survey_data['Education']
education_df.drop_duplicates(inplace=True)

In [28]:
education_df

     edu_id                   edu_title
0       NaN                   Not Asked
3470    NaN         Bachelors (4 years)
3473    NaN  None (no degree completed)
3475    NaN                     Masters
3494    NaN        Associates (2 years)
3536    NaN               Doctorate/PhD

In [29]:
education_df = education_df.reset_index(drop=True)
education_df.index +=1
education_df['edu_id']=education_df.index

In [30]:
education_df

   edu_id                   edu_title
1       1                   Not Asked
2       2         Bachelors (4 years)
3       3  None (no degree completed)
4       4                     Masters
5       5        Associates (2 years)
6       6               Doctorate/PhD

In [31]:
id_edu = survey_data['Education'].apply(lambda x: education_df[education_df['edu_title']==x].index[0])
sondage_item_df['edu_id'] = id_edu.astype(pd.Int64Dtype())

In [32]:
sondage_item_df['edu_id']

sgi_id
0        1
1        1
2        1
3        1
4        1
        ..
10336    3
10337    2
10338    2
10339    4
10340    3
Name: edu_id, Length: 10341, dtype: Int64

## DataFrame employment_sector

In [33]:
employment_sector_columns = pd.read_sql_query("select * from employment_sector;", engine).columns
employment_sector_columns

Index(['sec_id', 'sec_name'], dtype='object')

In [34]:
employment_sector_df = pd.DataFrame(columns = employment_sector_columns)
employment_sector_df['sec_name'] = survey_data['EmploymentSector']
employment_sector_df.drop_duplicates(inplace=True)

In [35]:
employment_sector_df

     sec_id                               sec_name
0       NaN                       Private business
3       NaN  Education (K-12, college, university)
21      NaN              State/province government
22      NaN                       Local government
25      NaN                             Non-profit
141     NaN                     Federal government
5700    NaN                                Student

In [36]:

employment_sector_df = employment_sector_df.reset_index(drop=True)
employment_sector_df.index +=1
employment_sector_df['sec_id']=employment_sector_df.index
id_sec = survey_data['EmploymentSector'].apply(lambda x: employment_sector_df[employment_sector_df['sec_name']==x].index[0])
sondage_item_df['sec_id'] = id_sec.astype(pd.Int64Dtype())

In [37]:
id_sec

0        1
1        1
2        1
3        2
4        1
        ..
10336    1
10337    1
10338    1
10339    1
10340    1
Name: EmploymentSector, Length: 10341, dtype: int64

## DataFrame employment_status

In [38]:
employment_status_columns = pd.read_sql_query("select * from employment_status;", engine).columns
employment_status_columns

Index(['emp_id', 'emp_status'], dtype='object')

In [39]:
employment_status_df = pd.DataFrame(columns = employment_status_columns)
employment_status_df['emp_status'] = survey_data['EmploymentStatus']
employment_status_df.drop_duplicates(inplace=True)

In [40]:
employment_status_df = employment_status_df.reset_index(drop=True)

employment_status_df.index +=1

In [41]:
employment_status_df['emp_id']=employment_status_df.index

In [42]:
employment_status_df

   emp_id                                         emp_status
1       1                                 Full time employee
2       2  Full time employee of a consulting/contracting...
3       3  Independent consultant, contractor, freelancer...
4       4                                          Part time
5       5         Independent or freelancer or company owner

In [43]:
id_emp = survey_data['EmploymentStatus'].apply(lambda x: employment_status_df[employment_status_df['emp_status']==x].index[0])
sondage_item_df['emp_id'] = id_emp.astype(pd.Int64Dtype())

In [44]:
sondage_item_df['emp_id']

sgi_id
0        1
1        1
2        1
3        1
4        1
        ..
10336    1
10337    1
10338    1
10339    1
10340    1
Name: emp_id, Length: 10341, dtype: Int64

## DataFrame how_many_companies

In [45]:
column_how_many_companies = pd.read_sql_query("select * from how_many_companies;", engine).columns
column_how_many_companies

Index(['mcp_id', 'mcp_many_companies'], dtype='object')

In [46]:
how_many_companies = pd.DataFrame(columns = column_how_many_companies)
how_many_companies['mcp_many_companies'] = survey_data['HowManyCompanies']
how_many_companies.drop_duplicates(inplace=True)
how_many_companies.reset_index(inplace=True)
how_many_companies.index +=1

In [47]:
how_many_companies['mcp_id']=how_many_companies.index

In [48]:
how_many_companies= how_many_companies.drop(columns='index')

In [49]:
how_many_companies

   mcp_id                                 mcp_many_companies
1       1  1 (this is the only company where I've had thi...
2       2                                                  5
3       3                                                  4
4       4  2 (I worked at another similar position elsewh...
5       5                                                  3
6       6                                          6 or more
7       7                                          Not Asked

In [50]:
# Settage des id pour sondage_df


id_mcp = survey_data["HowManyCompanies"].apply(lambda x: how_many_companies[how_many_companies["mcp_many_companies"] == x].index[0])
sondage_item_df['mcp_id'] = id_mcp.astype(pd.Int64Dtype())

In [51]:
#how_many_companies.to_sql("how_many_companies",if_exists="append", con=engine, index=False)

## DataFrame largest_city

In [52]:
largest_city_companies = pd.read_sql_query("select * from largest_city;", engine).columns
largest_city_companies

Index(['pop_id', 'pop_name'], dtype='object')

In [53]:
largest_city_df = pd.DataFrame(columns = largest_city_companies)
largest_city_df['pop_name'] = survey_data['PopulationOfLargestCityWithin20Miles']
largest_city_df.drop_duplicates(inplace=True)

In [54]:
largest_city_df

     pop_id              pop_name
0       NaN      <= 20,000 (town)
1       NaN      1M+ (metropolis)
2       NaN  300K-1M (large city)
4       NaN      100K-299K (city)
11      NaN  20K-99K (large town)
4349    NaN             Not Asked

In [55]:
largest_city_df = largest_city_df.reset_index(drop=True)
largest_city_df.index+=1

In [56]:
largest_city_df['pop_id'] = largest_city_df.index

In [57]:
id_pop = survey_data['PopulationOfLargestCityWithin20Miles'].apply(lambda x: largest_city_df[largest_city_df['pop_name']==x].index[0])
sondage_item_df['pop_id']= id_pop.astype(pd.Int64Dtype())

In [58]:
sondage_item_df['pop_id']

sgi_id
0        1
1        2
2        3
3        3
4        4
        ..
10336    6
10337    6
10338    6
10339    6
10340    6
Name: pop_id, Length: 10341, dtype: Int64

## DataFrame looking_job

In [59]:
looking_job_companies = pd.read_sql_query("select * from looking_job;", engine).columns
looking_job_companies

Index(['look_id', 'look_job'], dtype='object')

In [60]:
looking_job_df = pd.DataFrame(columns = looking_job_companies)
looking_job_df['look_job'] = survey_data['LookingForAnotherJob']
looking_job_df.drop_duplicates(inplace=True)

In [61]:
looking_job_df = looking_job_df.reset_index(drop=True)
looking_job_df.index +=1
looking_job_df['look_id']=looking_job_df.index

In [62]:
id_look = survey_data['LookingForAnotherJob'].apply(lambda x: looking_job_df[looking_job_df['look_job']==x].index[0])
sondage_item_df['look_id'] = id_look.astype(pd.Int64Dtype())

In [63]:
sondage_item_df['look_id']

sgi_id
0        1
1        1
2        1
3        1
4        1
        ..
10336    2
10337    3
10338    3
10339    4
10340    3
Name: look_id, Length: 10341, dtype: Int64

## DataFrame sondage

In [64]:
sondage_columns = pd.read_sql_query("select * from sondage;", engine).columns
sondage_columns

Index(['sdg_id', 'sdg_year'], dtype='object')

In [65]:
sondage_df = pd.DataFrame(columns = sondage_columns)
sondage_df['sdg_year'] = survey_data['Survey Year']
sondage_df.drop_duplicates(inplace=True)
sondage_df = sondage_df.rename_axis(index='sdg_id')
sondage_df = sondage_df.drop(columns='sdg_id')

In [66]:
sondage_df= sondage_df.reset_index()

In [67]:
sondage_df = sondage_df.drop(columns='sdg_id')

In [68]:
sondage_df = sondage_df.rename_axis(index='sdg_id')

In [69]:
sondage_df.index += 1

In [70]:
id_sdg = survey_data["Survey Year"].apply(lambda x: sondage_df[sondage_df["sdg_year"] == x].index[0])
sondage_item_df['sdg_id'] = id_sdg.astype(pd.Int64Dtype())

In [71]:
sondage_item_df['sdg_id']

sgi_id
0        1
1        1
2        1
3        1
4        1
        ..
10336    5
10337    5
10338    5
10339    5
10340    5
Name: sdg_id, Length: 10341, dtype: Int64

In [72]:
#sondage_df.to_sql("sondage",if_exists="append", con=engine, index=False)

---

## DataFrame job

In [73]:
job_columns = pd.read_sql_query("select * from job;", engine).columns
job_columns

Index(['job_id', 'job_name'], dtype='object')

In [74]:
job_df = survey_data['JobTitle']
job_df.drop_duplicates(inplace=True)
job_df = job_df.reset_index(drop=True)
job_df.index += 1

In [75]:
job_df = pd.DataFrame({"job_name": job_df})
job_df["job_id"]=job_df.index

In [76]:
job_df

                                             job_name  job_id
1   Developer: Business Intelligence (SSRS, PowerB...       1
2   DBA (Production Focus - build & troubleshoot s...       2
3   DBA (General - splits time evenly between writ...       3
4                                             Manager       4
5                   Developer: App code (C#, JS, etc)       5
6                                    Developer: T-SQL       6
7                                           Architect       7
8   DBA (Development Focus - tunes queries, indexe...       8
9                                            Engineer       9
10                                            Analyst      10
11                                              Other      11
12                                     Data Scientist      12
13                                                DBA      13
14                        Principal database engineer      14
15                   DevOps, Sr Software Engineer DBA      15
16                                        Technician       16
17                                Database Specialist      17
18                                         Consultant      18
19                              Systems Administrator      19
20                                              Sales      20
21                                 DBA / BI Developer      21
22                                     Sr Consultant       22
23                               Analytics consultant      23

In [77]:
id_jobtitle = survey_data["JobTitle"].apply(lambda x: job_df[job_df["job_name"] == x].index[0]) 
#pour ne pas prendre les None  if x is not None else x

In [78]:

#id_jobtitle.index -=1
#id_jobtitle.index +=1

In [79]:
id_jobtitle

0         1
1         2
2         3
3         2
4         1
         ..
10336    13
10337    13
10338    11
10339    13
10340     7
Name: JobTitle, Length: 10341, dtype: int64

## DataFrame other_duties

In [80]:
other_duties_columns = pd.read_sql_query("select * from other_duties;", engine).columns
other_duties_columns

Index(['job_id', 'sgi_id'], dtype='object')

In [81]:
sondage_item_df['job_id'] = id_jobtitle.astype(pd.Int64Dtype())

In [82]:
sondage_item_df["job_id"]

sgi_id
0         1
1         2
2         3
3         2
4         1
         ..
10336    13
10337    13
10338    11
10339    13
10340     7
Name: job_id, Length: 10341, dtype: Int64

## DataFrame task

In [83]:
task_columns = pd.read_sql_query("select * from task;", engine).columns
task_columns

Index(['tas_id', 'tas_name'], dtype='object')

In [84]:
survey_data[survey_data["KindsOfTasksPerformed"] == "Not Asked"]["KindsOfTasksPerformed"].apply(lambda x: None)

# sondage_item["tas_id"].astype(pd.Int64Dtype())
task_df = pd.DataFrame({ "tas_name": list(set([ i for ls in survey_data[~ pd.isna(survey_data["KindsOfTasksPerformed"])]["KindsOfTasksPerformed"].str.split(", ").to_list() for i in ls]))})
task_df.index += 1
task_df = task_df.rename_axis(index="tas_id")
task_df[task_df["tas_name"] == "Projects"].index[0]

5

In [85]:
"""task_df = pd.DataFrame(columns = task_columns)
task_df['tas_name'] = survey_data['KindsOfTasksPerformed'].str.split(', ')
task_df.drop_duplicates(inplace=True)"""

"task_df = pd.DataFrame(columns = task_columns)\ntask_df['tas_name'] = survey_data['KindsOfTasksPerformed'].str.split(', ')\ntask_df.drop_duplicates(inplace=True)"

In [86]:
task_df

                                tas_name
tas_id
1                      Training/teaching
2                                    R&D
3                  Meetings & management
4          On-call as part of a rotation
5                               Projects
6                              Not Asked
7                       On-call 24/7/365
8       Build scripts & automation tools
9                           Manual tasks

## DataFrame task_performed

In [87]:
task_columns = pd.read_sql_query("select * from task;", engine).columns
task_columns

Index(['tas_id', 'tas_name'], dtype='object')

## DataFrame database_used

In [88]:

database_used_df = survey_data['PrimaryDatabase']
database_used_df.drop_duplicates(inplace=True)
database_used_df = database_used_df.reset_index(drop=True)
database_used_df.index +=1
database_used_df = pd.DataFrame({"db_name" : database_used_df})
database_used_df = database_used_df.rename_axis(index = "db_id")

In [89]:
database_used_df

                       db_name
db_id
1         Microsoft SQL Server
2                   PostgreSQL
3                        Other
4                 Azure SQL DB
5             Microsoft Access
6                       Oracle
7                MySQL/MariaDB
8      Amazon RDS (any flavor)
9                      MongoDB
10                         DB2
11                   Cassandra
12                      SQLite
13                         SAP
14                    Teradata
15               Elasticsearch

In [90]:
id_db = survey_data["PrimaryDatabase"].apply(lambda x: database_used_df[database_used_df["db_name"] == x].index[0])
sondage_item_df["primary_db_id"]= id_db.astype(pd.Int64Dtype())

In [91]:
#sondage_item_df = sondage_item_df.drop('db_id',axis=1)
sondage_item_df["primary_db_id"].iloc[10243]

6

## DataFrame other_database

In [169]:
other_database_columns = pd.read_sql_query("select * from other_database;", engine).columns
other_database_columns
otherduties_df=pd.DataFrame(columns=other_duties_columns)

In [170]:
sondage_item_df

,timestamp,salary_usd,postal_code,years_with_db,manage_staff,years_with_job,other_people,company_employee,database_servers,education_computer,...,ctr_id,edu_id,sec_id,emp_id,mcp_id,pop_id,look_id,sdg_id,job_id,primary_db_id
sgi_id,,,,,,,,,,,,,,,,,,,,,
0,2020-12-10 08:22:42.696,65000.0,NaN,4,Yes,4,None,2,Not Asked,Not Asked,...,1,1,1,1,1,1,1,1,1,1
1,2020-12-10 08:23:22.242,145000.0,76063,15,No,25,None,74,Not Asked,Not Asked,...,2,1,1,1,2,2,1,1,2,1
2,2020-12-10 08:23:37.909,105000.0,43240,12,Yes,6,1,500,Not Asked,Not Asked,...,2,1,1,1,3,3,1,1,3,1
3,2020-12-10 08:23:48.152,46482.0,NaN,10,No,5,None,35,Not Asked,Not Asked,...,3,1,2,1,4,3,1,1,2,1
4,2020-12-10 08:24:03.600,98800.0,468,5,No,5,None,50,Not Asked,Not Asked,...,2,1,1,1,1,4,1,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10336,2017-01-14 15:50:23.936,36549.0,Not Asked,3,No,1,1,Not Asked,42,NaN,...,3,3,1,1,7,6,2,5,13,1
10337,2017-01-15 01:01:21.212,65000.0,Not Asked,7,Yes,3,5,Not Asked,40,Yes,...,73,2,1,1,7,6,3,5,13,1
10338,2017-01-15 03:25:47.422,85000.0,Not Asked,17,No,17,1,Not Asked,200,No,...,28,2,1,1,7,6,3,5,11,1
10339,2017-01-15 03:37:35.305,90000.0,Not Asked,8,No,3,1,Not Asked,80,Yes,...,2,4,1,1,7,6,4,5,13,1
10340,2017-01-15 03:37:59.149,23000.0,Not Asked,4,No,9,3,Not Asked,10,Yes,...,18,3,1,1,7,6,3,5,7,1

In [171]:
job_df.index = job_df['job_name'].str.len()
job_df = job_df.sort_index(ascending=False).reset_index(drop=True)

In [172]:
job_df

                                             job_name  job_id
0   DBA (General - splits time evenly between writ...       3
1   DBA (Development Focus - tunes queries, indexe...       8
2   DBA (Production Focus - build & troubleshoot s...       2
3   Developer: Business Intelligence (SSRS, PowerB...       1
4                   Developer: App code (C#, JS, etc)       5
5                    DevOps, Sr Software Engineer DBA      15
6                         Principal database engineer      14
7                               Systems Administrator      19
8                                Analytics consultant      23
9                                 Database Specialist      17
10                                 DBA / BI Developer      21
11                                   Developer: T-SQL       6
12                                     Sr Consultant       22
13                                     Data Scientist      12
14                                        Technician       16
15                                         Consultant      18
16                                          Architect       7
17                                           Engineer       9
18                                            Analyst      10
19                                            Manager       4
20                                              Other      11
21                                              Sales      20
22                                                DBA      13

In [173]:
#x=DBA (Development Focus - tunes queries, indexes, does deployments), DBA (General - splits time evenly between writing & tuning queries AND building & troubleshooting servers), Developer: T-SQL
def other_job(x):
    if isinstance(x,float):
        return None
    for key in range(job_df.shape[0]):
        job = job_df.iloc[key]
        x=str(x).replace(job["job_name"],str(job["job_id"]))
    return x
otherduties_df['job_id']=survey_data['OtherJobDuties'].apply(other_job)

In [174]:

otherduties_df['sgi_id']=otherduties_df.index+1

In [175]:
otherduties_df['job_id'][otherduties_df['job_id']=='Not Asked']=None

<ipython-input-175-2c4a1909eeaa>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  otherduties_df['job_id'][otherduties_df['job_id']=='Not Asked']=None

In [179]:
otherduties_df = otherduties_df[otherduties_df['job_id'].isna()!= True]

In [180]:
otherduties_df

          job_id  sgi_id
3470     8, 2, 6    3471
3471           4    3472
3472           2    3473
3473     7, 8, 3    3474
3474           8    3475
...          ...     ...
7438           6    7439
7439           7    7440
7440  7, 1, 6, 4    7441
7441  8, 3, 6, 4    7442
7442        7, 3    7443

[3355 rows x 2 columns]

In [100]:
#otherduties_df.to_sql("other_duties",if_exists="append", con=engine, index=False)

## DataFrame sondage_item

In [100]:
sondage_item_df

,timestamp,salary_usd,postal_code,years_with_db,manage_staff,years_with_job,other_people,company_employee,database_servers,education_computer,...,ctr_id,edu_id,sec_id,emp_id,mcp_id,pop_id,look_id,sdg_id,job_id,primary_db_id
sgi_id,,,,,,,,,,,,,,,,,,,,,
0,2020-12-10 08:22:42.696,65000.0,NaN,4,Yes,4,None,2,Not Asked,Not Asked,...,1,1,1,1,1,1,1,1,1,1
1,2020-12-10 08:23:22.242,145000.0,76063,15,No,25,None,74,Not Asked,Not Asked,...,2,1,1,1,2,2,1,1,2,1
2,2020-12-10 08:23:37.909,105000.0,43240,12,Yes,6,1,500,Not Asked,Not Asked,...,2,1,1,1,3,3,1,1,3,1
3,2020-12-10 08:23:48.152,46482.0,NaN,10,No,5,None,35,Not Asked,Not Asked,...,3,1,2,1,4,3,1,1,2,1
4,2020-12-10 08:24:03.600,98800.0,468,5,No,5,None,50,Not Asked,Not Asked,...,2,1,1,1,1,4,1,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10336,2017-01-14 15:50:23.936,36549.0,Not Asked,3,No,1,1,Not Asked,42,NaN,...,3,3,1,1,7,6,2,5,13,1
10337,2017-01-15 01:01:21.212,65000.0,Not Asked,7,Yes,3,5,Not Asked,40,Yes,...,73,2,1,1,7,6,3,5,13,1
10338,2017-01-15 03:25:47.422,85000.0,Not Asked,17,No,17,1,Not Asked,200,No,...,28,2,1,1,7,6,3,5,11,1
10339,2017-01-15 03:37:35.305,90000.0,Not Asked,8,No,3,1,Not Asked,80,Yes,...,2,4,1,1,7,6,4,5,13,1
10340,2017-01-15 03:37:59.149,23000.0,Not Asked,4,No,9,3,Not Asked,10,Yes,...,18,3,1,1,7,6,3,5,7,1

In [92]:
sondage_item_df.iloc[0]

timestamp             2020-12-10 08:22:42.696000
salary_usd                                 65000
postal_code                                  NaN
years_with_db                                  4
manage_staff                                 Yes
years_with_job                                 4
other_people                                None
company_employee                               2
database_servers                       Not Asked
education_computer                     Not Asked
hours_worked                           Not Asked
telecommute                            Not Asked
newest_version                   SQL Server 2016
oldest_version                   SQL Server 2016
gender                                      Male
cap_id                                         1
cert_id                                        1
ctr_id                                         1
edu_id                                         1
sec_id                                         1
emp_id                                         1
mcp_id                                         1
pop_id                                         1
look_id                                        1
sdg_id                                         1
job_id                                         1
primary_db_id                                  1
Name: 0, dtype: object

In [93]:
sondage_item_df.iloc[3471]

timestamp                    2018-12-11 06:22:55.508000
salary_usd                                        52922
postal_code                                         NaN
years_with_db                                         4
manage_staff                                        Yes
years_with_job                                        2
other_people                                          2
company_employee                                   6-99
database_servers                                      8
education_computer                                  Yes
hours_worked                                         38
telecommute           None, or less than 1 day per week
newest_version                                Not Asked
oldest_version                                Not Asked
gender                                             Male
cap_id                                                1
cert_id                                               2
ctr_id                                                3
edu_id                                                2
sec_id                                                1
emp_id                                                1
mcp_id                                                4
pop_id                                                3
look_id                                               2
sdg_id                                                3
job_id                                                8
primary_db_id                                         1
Name: 3471, dtype: object

In [101]:
how_many_companies

                                       mcp_many_companies
mcp_id
1       1 (this is the only company where I've had thi...
2                                                       5
3                                                       4
4       2 (I worked at another similar position elsewh...
5                                                       3
6                                               6 or more
7                                               Not Asked

In [308]:
#employment_status_df.to_sql("employment_status",if_exists="append", con=engine, index=False)
#OK

In [319]:
#carreer_plan_df.to_sql("carreer_plan",if_exists="append", con=engine, index=False)
#OK

In [103]:
#how_many_companies.to_sql("how_many_companies",if_exists="append", con=engine, index=False)
#OK

In [106]:
#certification_df.to_sql("certification",if_exists="append", con=engine, index=False)
#OK

In [113]:
#country_df= country_df.drop(columns='index')

              ctr_name
ctr_id
1               Sweden
2        United States
3       United Kingdom
4             Pakistan
5             Paraguay
...                ...
93             Albania
94             Bolivia
95             Vietnam
96             Bermuda
97               Kenya

[97 rows x 1 columns]

In [114]:
#country_df.to_sql("country",if_exists="append", con=engine, index=False)
#OK

In [115]:
looking_job_df

                                         look_job
look_id
1                                       Not Asked
2                                              No
3          Yes, but only passively (just curious)
4        Yes, actively looking for something else

In [116]:
#looking_job_df.to_sql("looking_job",if_exists="append", con=engine, index=False)
#OK

In [117]:
employment_sector_df

                                     sec_name
sec_id
1                            Private business
2       Education (K-12, college, university)
3                   State/province government
4                            Local government
5                                  Non-profit
6                          Federal government
7                                     Student

In [118]:
#employment_sector_df.to_sql("employment_sector",if_exists="append", con=engine, index=False)
#OK

In [119]:
sondage_df

        sdg_year
sdg_id
1           2021
2           2020
3           2019
4           2018
5           2017

In [120]:
#sondage_df.to_sql("sondage",if_exists="append", con=engine, index=False)
#OK

In [121]:
education_df

                         edu_title
edu_id
1                        Not Asked
2              Bachelors (4 years)
3       None (no degree completed)
4                          Masters
5             Associates (2 years)
6                    Doctorate/PhD

In [122]:
#education_df.to_sql("education",if_exists="append", con=engine, index=False)
#OK

In [123]:
largest_city_df

                    pop_name
pop_id
1           <= 20,000 (town)
2           1M+ (metropolis)
3       300K-1M (large city)
4           100K-299K (city)
5       20K-99K (large town)
6                  Not Asked

In [124]:
#largest_city_df.to_sql("largest_city",if_exists="append", con=engine, index=False)
#OK

In [125]:
job_df

                                             job_name
1   Developer: Business Intelligence (SSRS, PowerB...
2   DBA (Production Focus - build & troubleshoot s...
3   DBA (General - splits time evenly between writ...
4                                             Manager
5                   Developer: App code (C#, JS, etc)
6                                    Developer: T-SQL
7                                           Architect
8   DBA (Development Focus - tunes queries, indexe...
9                                            Engineer
10                                            Analyst
11                                              Other
12                                     Data Scientist
13                                                DBA
14                        Principal database engineer
15                   DevOps, Sr Software Engineer DBA
16                                        Technician
17                                Database Specialist
18                                         Consultant
19                              Systems Administrator
20                                              Sales
21                                 DBA / BI Developer
22                                     Sr Consultant
23                               Analytics consultant

In [315]:
#job_df.to_sql("job",if_exists="append", con=engine, index=False)
#OK

In [128]:
#task_df.to_sql("task",if_exists="append", con=engine, index=False)
#OK

In [129]:
#database_used_df.to_sql("database",if_exists="append", con=engine, index=False)
#OK

In [234]:
sondage_item_df['manage_staff'][sondage_item_df['manage_staff']=='Yes']=True
sondage_item_df['manage_staff'][sondage_item_df['manage_staff']=='No']=False

<ipython-input-234-aefa9c16ad21>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sondage_item_df['manage_staff'][sondage_item_df['manage_staff']=='Yes']=True
<ipython-input-234-aefa9c16ad21>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sondage_item_df['manage_staff'][sondage_item_df['manage_staff']=='No']=False

In [237]:
sondage_item_df['other_people'][sondage_item_df['other_people']=='None']=0

<ipython-input-237-e4808c568f29>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sondage_item_df['other_people'][sondage_item_df['other_people']=='None']=0

In [241]:
sondage_item_df['database_servers'][sondage_item_df['database_servers']=='Not Asked']=None

<ipython-input-241-c123ddc4e739>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sondage_item_df['database_servers'][sondage_item_df['database_servers']=='Not Asked']=None

In [249]:
sondage_item_df['hours_worked'][sondage_item_df['hours_worked']=='Not Asked']=None

<ipython-input-249-741daaa7ad7f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  sondage_item_df['hours_worked'][sondage_item_df['hours_worked']=='Not Asked']=None

In [328]:
#sondage_item_df.index+=1
sondage_item_df.iloc[4948]

timestamp                    2017-12-12 19:07:35.807000
salary_usd                                        95000
postal_code                                         NaN
years_with_db                                     53716
manage_staff                                      False
years_with_job                                        1
other_people                                          4
company_employee                              Not Asked
database_servers                                    600
education_computer                                   No
hours_worked                                         45
telecommute           None, or less than 1 day per week
newest_version                                Not Asked
oldest_version                                Not Asked
gender                                           Female
cap_id                                                1
cert_id                                               3
ctr_id                                                2
edu_id                                                2
sec_id                                                1
emp_id                                                2
mcp_id                                                7
pop_id                                                6
look_id                                               3
sdg_id                                                4
job_id                                                9
primary_db_id                                         1
Name: 4949, dtype: object

In [329]:
#sondage_item_df.to_sql("sondage_item",if_exists="append", con=engine, index=False)